HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEth_bf.h
/** \\brief  Length for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_LEN (1)

/** \\brief  Mask for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_DEBUG_Bits.TXSTSFSTS */
#define IFX_ETH_DEBUG_TXSTSFSTS_OFF (25)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_LEN (1)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.DZPQ */
#define IFX_ETH_FLOW_CONTROL_DZPQ_OFF (7)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_LEN (1)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.FCA_BPA */
#define IFX_ETH_FLOW_CONTROL_FCA_BPA_OFF (0)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_LEN (2)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.PLT */
#define IFX_ETH_FLOW_CONTROL_PLT_OFF (4)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_LEN (16)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_MSK (0xffff)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.PT */
#define IFX_ETH_FLOW_CONTROL_PT_OFF (16)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_LEN (1)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.RFE */
#define IFX_ETH_FLOW_CONTROL_RFE_OFF (2)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_LEN (1)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.TFE */
#define IFX_ETH_FLOW_CONTROL_TFE_OFF (1)

/** \\brief  Length for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_LEN (1)

/** \\brief  Mask for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_FLOW_CONTROL_Bits.UP */
#define IFX_ETH_FLOW_CONTROL_UP_OFF (3)

/** \\brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_LEN (4)

/** \\brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_MSK (0xf)

/** \\brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.CR */
#define IFX_ETH_GMII_ADDRESS_CR_OFF (2)

/** \\brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_LEN (1)

/** \\brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GB */
#define IFX_ETH_GMII_ADDRESS_GB_OFF (0)

/** \\brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_LEN (5)

/** \\brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_MSK (0x1f)

/** \\brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GR */
#define IFX_ETH_GMII_ADDRESS_GR_OFF (6)

/** \\brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_LEN (1)

/** \\brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.GW */
#define IFX_ETH_GMII_ADDRESS_GW_OFF (1)

/** \\brief  Length for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_LEN (5)

/** \\brief  Mask for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_MSK (0x1f)

/** \\brief  Offset for Ifx_ETH_GMII_ADDRESS_Bits.PA */
#define IFX_ETH_GMII_ADDRESS_PA_OFF (11)

/** \\brief  Length for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_LEN (16)

/** \\brief  Mask for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_MSK (0xffff)

/** \\brief  Offset for Ifx_ETH_GMII_DATA_Bits.GD */
#define IFX_ETH_GMII_DATA_GD_OFF (0)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI0 */
#define IFX_ETH_GPCTL_ALTI0_OFF (0)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI10 */
#define IFX_ETH_GPCTL_ALTI10_OFF (20)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI1 */
#define IFX_ETH_GPCTL_ALTI1_OFF (2)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI2 */
#define IFX_ETH_GPCTL_ALTI2_OFF (4)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI3 */
#define IFX_ETH_GPCTL_ALTI3_OFF (6)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI4 */
#define IFX_ETH_GPCTL_ALTI4_OFF (8)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI5 */
#define IFX_ETH_GPCTL_ALTI5_OFF (10)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI6 */
#define IFX_ETH_GPCTL_ALTI6_OFF (12)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_LEN (2)

