HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEth_bf.h
/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI7 */
#define IFX_ETH_GPCTL_ALTI7_OFF (14)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI8 */
#define IFX_ETH_GPCTL_ALTI8_OFF (16)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_LEN (2)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.ALTI9 */
#define IFX_ETH_GPCTL_ALTI9_OFF (18)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.DIV */
#define IFX_ETH_GPCTL_DIV_LEN (1)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.DIV */
#define IFX_ETH_GPCTL_DIV_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.DIV */
#define IFX_ETH_GPCTL_DIV_OFF (25)

/** \\brief  Length for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_LEN (1)

/** \\brief  Mask for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_GPCTL_Bits.EPR */
#define IFX_ETH_GPCTL_EPR_OFF (24)

/** \\brief  Length for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_LEN (32)

/** \\brief  Mask for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_HASH_TABLE_HIGH_Bits.HTH */
#define IFX_ETH_HASH_TABLE_HIGH_HTH_OFF (0)

/** \\brief  Length for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_LEN (32)

/** \\brief  Mask for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_MSK (0xffffffff)

/** \\brief  Offset for Ifx_ETH_HASH_TABLE_LOW_Bits.HTL */
#define IFX_ETH_HASH_TABLE_LOW_HTL_OFF (0)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.ACTPHYIF */
#define IFX_ETH_HW_FEATURE_ACTPHYIF_LEN (3)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.ACTPHYIF */
#define IFX_ETH_HW_FEATURE_ACTPHYIF_MSK (0x7)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.ACTPHYIF */
#define IFX_ETH_HW_FEATURE_ACTPHYIF_OFF (28)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.ADDMACADRSEL */
#define IFX_ETH_HW_FEATURE_ADDMACADRSEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.ADDMACADRSEL */
#define IFX_ETH_HW_FEATURE_ADDMACADRSEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.ADDMACADRSEL */
#define IFX_ETH_HW_FEATURE_ADDMACADRSEL_OFF (5)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.AVSEL */
#define IFX_ETH_HW_FEATURE_AVSEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.AVSEL */
#define IFX_ETH_HW_FEATURE_AVSEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.AVSEL */
#define IFX_ETH_HW_FEATURE_AVSEL_OFF (15)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.EEESEL */
#define IFX_ETH_HW_FEATURE_EEESEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.EEESEL */
#define IFX_ETH_HW_FEATURE_EEESEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.EEESEL */
#define IFX_ETH_HW_FEATURE_EEESEL_OFF (14)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.ENHDESSEL */
#define IFX_ETH_HW_FEATURE_ENHDESSEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.ENHDESSEL */
#define IFX_ETH_HW_FEATURE_ENHDESSEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.ENHDESSEL */
#define IFX_ETH_HW_FEATURE_ENHDESSEL_OFF (24)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.EXTHASHEN */
#define IFX_ETH_HW_FEATURE_EXTHASHEN_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.EXTHASHEN */
#define IFX_ETH_HW_FEATURE_EXTHASHEN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.EXTHASHEN */
#define IFX_ETH_HW_FEATURE_EXTHASHEN_OFF (3)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.FLEXIPPSEN */
#define IFX_ETH_HW_FEATURE_FLEXIPPSEN_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.FLEXIPPSEN */
#define IFX_ETH_HW_FEATURE_FLEXIPPSEN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.FLEXIPPSEN */
#define IFX_ETH_HW_FEATURE_FLEXIPPSEN_OFF (26)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.GMIISEL */
#define IFX_ETH_HW_FEATURE_GMIISEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.GMIISEL */
#define IFX_ETH_HW_FEATURE_GMIISEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.GMIISEL */
#define IFX_ETH_HW_FEATURE_GMIISEL_OFF (1)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.HASHSEL */
#define IFX_ETH_HW_FEATURE_HASHSEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.HASHSEL */
#define IFX_ETH_HW_FEATURE_HASHSEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.HASHSEL */
#define IFX_ETH_HW_FEATURE_HASHSEL_OFF (4)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.HDSEL */
#define IFX_ETH_HW_FEATURE_HDSEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.HDSEL */
#define IFX_ETH_HW_FEATURE_HDSEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.HDSEL */
#define IFX_ETH_HW_FEATURE_HDSEL_OFF (2)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.INTTSEN */
#define IFX_ETH_HW_FEATURE_INTTSEN_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.INTTSEN */
#define IFX_ETH_HW_FEATURE_INTTSEN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.INTTSEN */
#define IFX_ETH_HW_FEATURE_INTTSEN_OFF (25)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.L3L4FLTREN */
#define IFX_ETH_HW_FEATURE_L3L4FLTREN_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.L3L4FLTREN */
#define IFX_ETH_HW_FEATURE_L3L4FLTREN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.L3L4FLTREN */
#define IFX_ETH_HW_FEATURE_L3L4FLTREN_OFF (7)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.MGKSEL */
#define IFX_ETH_HW_FEATURE_MGKSEL_LEN (1)

/** \\brief  Mask for Ifx_ETH_HW_FEATURE_Bits.MGKSEL */
#define IFX_ETH_HW_FEATURE_MGKSEL_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_HW_FEATURE_Bits.MGKSEL */
#define IFX_ETH_HW_FEATURE_MGKSEL_OFF (10)

/** \\brief  Length for Ifx_ETH_HW_FEATURE_Bits.MIISEL */
#define IFX_ETH_HW_FEATURE_MIISEL_LEN (1)

