HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEth_bf.h
/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFA2 */
#define IFX_ETH_OPERATION_MODE_RFA2_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFA2 */
#define IFX_ETH_OPERATION_MODE_RFA2_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFA2 */
#define IFX_ETH_OPERATION_MODE_RFA2_OFF (23)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFA */
#define IFX_ETH_OPERATION_MODE_RFA_LEN (2)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFA */
#define IFX_ETH_OPERATION_MODE_RFA_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFA */
#define IFX_ETH_OPERATION_MODE_RFA_OFF (9)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFD2 */
#define IFX_ETH_OPERATION_MODE_RFD2_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFD2 */
#define IFX_ETH_OPERATION_MODE_RFD2_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFD2 */
#define IFX_ETH_OPERATION_MODE_RFD2_OFF (22)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFD */
#define IFX_ETH_OPERATION_MODE_RFD_LEN (2)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFD */
#define IFX_ETH_OPERATION_MODE_RFD_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFD */
#define IFX_ETH_OPERATION_MODE_RFD_OFF (11)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RSF */
#define IFX_ETH_OPERATION_MODE_RSF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RSF */
#define IFX_ETH_OPERATION_MODE_RSF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RSF */
#define IFX_ETH_OPERATION_MODE_RSF_OFF (25)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RTC */
#define IFX_ETH_OPERATION_MODE_RTC_LEN (2)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RTC */
#define IFX_ETH_OPERATION_MODE_RTC_MSK (0x3)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RTC */
#define IFX_ETH_OPERATION_MODE_RTC_OFF (3)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.SR */
#define IFX_ETH_OPERATION_MODE_SR_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.SR */
#define IFX_ETH_OPERATION_MODE_SR_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.SR */
#define IFX_ETH_OPERATION_MODE_SR_OFF (1)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.ST */
#define IFX_ETH_OPERATION_MODE_ST_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.ST */
#define IFX_ETH_OPERATION_MODE_ST_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.ST */
#define IFX_ETH_OPERATION_MODE_ST_OFF (13)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.TSF */
#define IFX_ETH_OPERATION_MODE_TSF_LEN (1)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.TSF */
#define IFX_ETH_OPERATION_MODE_TSF_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.TSF */
#define IFX_ETH_OPERATION_MODE_TSF_OFF (21)

/** \\brief  Length for Ifx_ETH_OPERATION_MODE_Bits.TTC */
#define IFX_ETH_OPERATION_MODE_TTC_LEN (3)

/** \\brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.TTC */
#define IFX_ETH_OPERATION_MODE_TTC_MSK (0x7)

/** \\brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.TTC */
#define IFX_ETH_OPERATION_MODE_TTC_OFF (14)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_ETH_PMT_CONTROL_STATUS_GLBLUCAST_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_ETH_PMT_CONTROL_STATUS_GLBLUCAST_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_ETH_PMT_CONTROL_STATUS_GLBLUCAST_OFF (9)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPKTEN_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPKTEN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPKTEN_OFF (1)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPRCVD_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPRCVD_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPRCVD_OFF (5)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_ETH_PMT_CONTROL_STATUS_PWRDWN_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_ETH_PMT_CONTROL_STATUS_PWRDWN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_ETH_PMT_CONTROL_STATUS_PWRDWN_OFF (0)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKFILTRST_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKFILTRST_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKFILTRST_OFF (31)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_OFF (2)

/** \\brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_LEN (1)

/** \\brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_MSK (0x1)

/** \\brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_OFF (6)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_LEN (3)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_MSK (0x7)

/** \\brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_OFF (8)

/** \\brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_LEN (3)

/** \\brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_MSK (0x7)

